# Play With Interface

In [23]:
import numpy as np
import pandas as pd
from pandasql import sqldf as pd_sql

## fake data

In [24]:
data = [{'f_int': i, 'f_str': f'v{i}', 'f_float': np.round(1 + 0.1*i, 2)} for i in range(0,10)]
data

[{'f_int': 0, 'f_str': 'v0', 'f_float': 1.0},
 {'f_int': 1, 'f_str': 'v1', 'f_float': 1.1},
 {'f_int': 2, 'f_str': 'v2', 'f_float': 1.2},
 {'f_int': 3, 'f_str': 'v3', 'f_float': 1.3},
 {'f_int': 4, 'f_str': 'v4', 'f_float': 1.4},
 {'f_int': 5, 'f_str': 'v5', 'f_float': 1.5},
 {'f_int': 6, 'f_str': 'v6', 'f_float': 1.6},
 {'f_int': 7, 'f_str': 'v7', 'f_float': 1.7},
 {'f_int': 8, 'f_str': 'v8', 'f_float': 1.8},
 {'f_int': 9, 'f_str': 'v9', 'f_float': 1.9}]

In [25]:
df = pd.DataFrame(data)
df.head(3)

   f_int f_str  f_float
0      0    v0      1.0
1      1    v1      1.1
2      2    v2      1.2

In [26]:
def sql(query: str, show: bool | int = 0, verbose: bool = False) -> pd.DataFrame:
    if verbose:
        print(query)
    result = pd_sql(query)

    show = 3 if isinstance(show, bool) and show is True else int(show)
    if show > 0:
        display(result.head(show))
    return result

sql("select * from df", True, True)
sql("select * from df", False, True)
sql("select * from df")

select * from df

   f_int f_str  f_float
0      0    v0      1.0
1      1    v1      1.1
2      2    v2      1.2

select * from df

   f_int f_str  f_float
0      0    v0      1.0
1      1    v1      1.1
2      2    v2      1.2
3      3    v3      1.3
4      4    v4      1.4
5      5    v5      1.5
6      6    v6      1.6
7      7    v7      1.7
8      8    v8      1.8
9      9    v9      1.9

##  try filters

In [27]:
# exptected
sql("select * from df where 1=1")

   f_int f_str  f_float
0      0    v0      1.0
1      1    v1      1.1
2      2    v2      1.2
3      3    v3      1.3
4      4    v4      1.4
5      5    v5      1.5
6      6    v6      1.6
7      7    v7      1.7
8      8    v8      1.8
9      9    v9      1.9

In [28]:
from predicate import *

In [29]:
predicate = LogicalEqual(1, 1)
predicate.evaluate()

'(1) = (1)'

In [30]:
def test_predicate(predicate):
    query = f"""\
    select *
    from df
    where {predicate.evaluate()}
    """
    return sql(query, False, True)

test_predicate(LogicalEqual(1,1))

    select *
    from df
    where (1) = (1)

   f_int f_str  f_float
0      0    v0      1.0
1      1    v1      1.1
2      2    v2      1.2
3      3    v3      1.3
4      4    v4      1.4
5      5    v5      1.5
6      6    v6      1.6
7      7    v7      1.7
8      8    v8      1.8
9      9    v9      1.9

In [31]:
test_predicate(LogicalEqual(Field('f_int'), 1))

    select *
    from df
    where (f_int) = (1)

   f_int f_str  f_float
0      1    v1      1.1

In [32]:
eq1 = LogicalEqual(Field('f_int'), 1)
eq2 = LogicalEqual(Field('f_int'), 7)

test_predicate(LogicalEqual(Field('f_int'), 1))

    select *
    from df
    where (f_int) = (1)

   f_int f_str  f_float
0      1    v1      1.1